#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:eu-west-2:071148681943:cluster/ecs_cluster]
data.aws_iam_policy_document.assume_role_policy: Reading...
data.aws_ecr_repository.tessian-demo-ramg: Reading...
data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
aws_iam_role.testecsTaskExecutionRole: Refreshing state... [id=testecsTaskExecutionRole]
aws_vpc.my_vpc: Refreshing state... [id=vpc-0408fd85322ef8820]
aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy: Refreshing state... [id=testecsTaskExecutionRole-20230807185900577600000001]
data.aws_ecr_repository.tessian-demo-ramg: Read complete after 1s [id=tessian-demo-ramg]
aws_ecs_task_definition.task_definition: Refreshing state... [id=task]
aws_security_group.ecs_sg: Refreshing state... [id=sg-010b31a39c5c3bb09]
aws_subnet.pub-subnet1: Refreshing state... [id=subnet-03a85786c7ba1bfbd]
aws_subnet.pub-subnet2: Refreshing state... [id=subnet-0439bc9d37ee91611]
aws_internet_gateway.gw: Refreshing state... [id=igw-0d84d1c4cc2e94d54]
aws_lb_target_group.my_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:071148681943:targetgroup/my-target-group/9715691ffe9b5e9e]
aws_route_table.main-route-table: Refreshing state... [id=rtb-0c9d4d82e5eabba72]
aws_lb.test-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:071148681943:loadbalancer/app/test-lb/63246a5f46e15639]
aws_route_table_association.public2_association: Refreshing state... [id=rtbassoc-02108a44e69dba4ec]
aws_route_table_association.public1_association: Refreshing state... [id=rtbassoc-046a8914939c8ee38]
aws_lb_listener.https_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:071148681943:listener/app/test-lb/63246a5f46e15639/5e0acdfcec1a5730]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.my_service will be created
  + resource "aws_ecs_service" "my_service" {
      + cluster                            = "arn:aws:ecs:eu-west-2:071148681943:cluster/ecs_cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "my-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:eu-west-2:071148681943:task-definition/task:1"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "my-container"
          + container_port   = 8000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-010b31a39c5c3bb09",
            ]
          + subnets          = [
              + "subnet-03a85786c7ba1bfbd",
              + "subnet-0439bc9d37ee91611",
            ]
        }
    }

  # aws_lb_target_group.my_target_group must be replaced
-/+ resource "aws_lb_target_group" "my_target_group" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-west-2:071148681943:targetgroup/my-target-group/9715691ffe9b5e9e" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/my-target-group/9715691ffe9b5e9e" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-west-2:071148681943:targetgroup/my-target-group/9715691ffe9b5e9e" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
        name                               = "my-target-group"
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      ~ target_type                        = "instance" -> "ip" # forces replacement
        # (8 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200" -> (known after apply)
          ~ timeout             = 5 -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @ramg777, Action: `pull_request`*